Loser9527/Cortex-M/STM32F103/1.3_LCD-ST7789/1.3_LCD-ST7789 - DMA/User/spi/bsp_spi_dma.h
#ifndef __BSP_SPI_H
#define __BSP_SPI_H

#include "stm32f10x.h"


/*SPI接口定义-开头****************************/
#define				SPIx													SPI1
#define				SPI_APBxClock_FUN							RCC_APB2PeriphClockCmd
#define				SPI_CLK												RCC_APB2Periph_SPI1

//CS(NSS)引脚 片选选普通GPIO即可
#define				SPI_LCD_CS_CLK								RCC_APB2Periph_GPIOC
#define				SPI_LCD_CS_PORT								GPIOC
#define				SPI_LCD_CS_PIN								GPIO_Pin_0

//SCK引脚
#define				SPI_SCK_CLK										RCC_APB2Periph_GPIOA   
#define				SPI_SCK_PORT									GPIOA   
#define				SPI_SCK_PIN										GPIO_Pin_5
//MISO引脚
#define				SPI_MISO_CLK									RCC_APB2Periph_GPIOA    
#define				SPI_MISO_PORT									GPIOA 
#define				SPI_MISO_PIN									GPIO_Pin_6
//MOSI引脚
#define				SPI_MOSI_CLK									RCC_APB2Periph_GPIOA    
#define				SPI_MOSI_PORT									GPIOA 
#define				SPI_MOSI_PIN									GPIO_Pin_7

#define				SPI_LCD_CS_LOW()							GPIO_ResetBits( SPI_LCD_CS_PORT, SPI_LCD_CS_PIN )
#define				SPI_LCD_CS_HIGH()							GPIO_SetBits( SPI_LCD_CS_PORT, SPI_LCD_CS_PIN )

/*SPI接口定义-结尾****************************/


#define DMA_CHANNEL     DMA1_Channel3
#define DMA_CLOCK       RCC_AHBPeriph_DMA1

// 传输完成标志
#define DMA_FLAG_TC     DMA1_FLAG_TC3



void SPIx_Init(void);
uint8_t SPIx_SendByte(uint8_t byte);
uint16_t SPIx_SendHalfWord(uint16_t HalfWord);
void SPIx_DataSize(uint8_t datasize);
void DMA_Config(void);
void SPIx_DMA_TxSingle(uint16_t *buffer,uint16_t len_byte);

#endif
